word = input()  # მომხმარებელს შეჰყავს სიტყვა

for i in range(len(word)):  # გადავუვლით სიტყვის ყველა ინდექსს
    if i % 2 == 1:  # ვამოწმებთ, არის თუ არა ინდექსი კენტი
        print(word[i])  # ვბეჭდავთ სიმბოლოს ახალ ხაზზე გადასვლის გარეშე
        if i < len(word) - 2:  # ვამოწმებთ, დარჩა თუ არა კენტ ინდექსზე სიმბოლო
            print(" ")  #სიმბოლოს შემდეგ ვბეჭდავთ ვარსკვლავს








#text = "საქართველო"  # ვინახავთ მოცემულ სიტყვას
# vowels = "აეიოუ"  # ვინახავთ ქართულ ხმოვნებს
# count = 0  # ხმოვნების მთვლელი

# for i in range(len(text)):  # გადავუვლით ტექსტის ყველა ინდექსს
#     if text[i] in vowels:  # ვამოწმებთ, არის თუ არა სიმბოლო ხმოვანი
#         print(i, text[i])  # ვბეჭდავთ ხმოვნის ინდექსსა და სიმბოლოს
#         count += 1  # ხმოვნების რაოდენობას ვზრდით ერთით

# print("ხმოვნების რაოდენობა:", count)  # ვბეჭდავთ ხმოვნების საერთო რაოდენობას








# nums = [3, 7, 2, 9, 4, 4, 8]  # მოცემული რიცხვების სია
# count = 0  # ზრდადი წყვილების მთვლელი

# for i in range(len(nums) - 1):  # გადავუვლით ყველა ელემენტს, გარდა უკანასკნელისა
#     if nums[i] < nums[i + 1]:  # ვამოწმებთ, მომდევნო ელემენტი მეტია თუ არა წინაზე
#         count += 1  # ზრდადი წყვილების რაოდენობას ვზრდით ერთით
#         print("ინდექსები:", i, i + 1)  # ვბეჭდავთ წყვილის ინდექსებს

# print("რაოდენობა:", count)  # ვბეჭდავთ ზრდადი წყვილების საერთო რაოდენობას







# text = input()  # მომხმარებელს შეჰყავს წინადადება
# count = 0  # ვითვლით ასო "ა"-ს რაოდენობას

# for i in range(len(text)):  # გადავუყვებით წინადადების ყველა ინდექსს
#     if text[i] == "ა":  # ვამოწმებთ, არის თუ არა ამ ინდექსზე ასო "ა"
#         print(i)  # ვბეჭდავთ ასო "ა"-ს ინდექსს
#         count += 1  # რაოდენობას ვზრდით ერთით

# print("რაოდენობა:", count)  # ვბეჭდავთ ასო "ა"-ს საერთო რაოდენობას